slides/Project2.org
* Project: URL shortener :slide:
  + Demo: [[http://bitly.com][bitly]]
  + This project is simpler

* Project Overview :slide:
  + Teams of up to *4*
  + Part 1: Implement select feature set
  + Part 2: Get creative! Implement product ideas
** Notes :notes:
  + You may switch teams, but not recommended

* Dates :slide:
  + Oct 30th: Part 1 due
  + Nov 13th: Optional Part 2 Proposal
  + Dec 4th: Project Code Due
  + Dec 12th: Class presentation
  + Dec 19th: Technical report due

** Part 2 Details :slide:
   + # of people ~= # of features
   + Features should be comprehensive
   + Features should be web related
   + Evaluation on end-user criteria (including delight)
** Heuristics :notes:
   + Roughly same number of features as number of people
   + But do not simply just split up the work
   + Because your features need to be cross compatible
   + If you make the site mobile compatible, then all pages should be
   + Don't spend 2 weeks in photoshop making an awesome background
   + If you do a data mining compoenent, it needs to be related to web
     activity, or inform the web interface (maybe recommendations?)
   + Evaluated: do your forms work, is the page semantic to enable
     accessability, is the interface pleasent to use, is it useful?

** Some Ideas :slide:
   + Automatically choose short path
   + Use the same short path for existing URLs
   + User sign-in
   + Mobile interface
   + REST interface
   + Recommendation system
** Additions :notes:
   + OK to generate some data for ML related features

* Proposal :slide:
  + What features will you complete?
  + Roughly how they will work
  + What you anticipate main challenge to be
  + Include all team member names
** Details :notes:
   + Work: mostly from an end-user perspective
   + Challenges: so I understand where the team is. Ideally you're exploring
     an area in which you have less experience

* Project 2 Deliverables :slide:
  + Code
  + Slides
  + Technical Report
** How to :notes:
   + Pull request should have everything.
   + PDF/PPT of slides
   + PDF or Tech report
   + Presentation may be mostly demo, that's fine. Don't do many slides

* Code :slide:
  + Ideally will be runnable on ISchool
  + Advanced work, please use =virtualenv= with =requirements.txt=
  + If its not implemented, no credit
  + User facing quality is evaluated
** Quality :notes:
   + Not just "pretty" but functional and using the ideas we talked about in
     class
   + Semantic markup, CSS for style, REST where appropriate
   + Corner cases, validation, security

* Presentation :slide:
  + Very fast! 10 minutes max
  + Try out the projector before/after class, spare
  + Live demos strongly encouraged, backup
** Depends :notes:
   + Will depends on how many submissions I get
   + Will go in alphabetical order of last name
   + Make people interested in your technical report: "Whoa, how did you do
     that?"

* Technical Report :slide:
  + Intro
  + ~1 page / feature
  + Problem, example, technology, challeneges, alternatives, future
** Heuristic :notes:
  + I should have a good start re-implementing your features
  +  What problem is it solving?
  +  An example walk though by a user
  +  The technology details for how you solved it (give an overview, not a step-though of the code)
  +  Problems you overcame (what advice would you give your past-self before implementing the feature?)
  +  Alternatives you considered with trade-offs
  +  Ideas for improving the feature in the future

#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+HTML_HEAD_EXTRA: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
