slides/Project2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Project2</title>
<!-- 2014-10-30 Thu 21:51 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jim Blomo" />
<link rel="stylesheet" type="text/css" href="production/common.css" />
<link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
<link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
<link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
<link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Project2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Project: URL shortener</a></li>
<li><a href="#sec-2">2. Project Overview</a>
<ul>
<li><a href="#sec-2-1">2.1. Notes</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Dates</a>
<ul>
<li><a href="#sec-3-1">3.1. Part 2 Details</a></li>
<li><a href="#sec-3-2">3.2. Heuristics</a></li>
<li><a href="#sec-3-3">3.3. Some Ideas</a></li>
<li><a href="#sec-3-4">3.4. Additions</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Proposal</a>
<ul>
<li><a href="#sec-4-1">4.1. Details</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Project 2 Deliverables</a>
<ul>
<li><a href="#sec-5-1">5.1. How to</a></li>
</ul>
</li>
<li><a href="#sec-6">6. Code</a>
<ul>
<li><a href="#sec-6-1">6.1. Quality</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Presentation</a>
<ul>
<li><a href="#sec-7-1">7.1. Depends</a></li>
</ul>
</li>
<li><a href="#sec-8">8. Technical Report</a>
<ul>
<li><a href="#sec-8-1">8.1. Heuristic</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Project: URL shortener&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Demo: <a href="http://bitly.com">bitly</a>
</li>
<li>This project is simpler
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Project Overview&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Teams of up to <b>4</b>
</li>
<li>Part 1: Implement select feature set
</li>
<li>Part 2: Get creative! Implement product ideas
</li>
</ul>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Notes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>You may switch teams, but not recommended
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Dates&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Oct 30th: Part 1 due
</li>
<li>Nov 13th: Optional Part 2 Proposal
</li>
<li>Dec 4th: Project Code Due
</li>
<li>Dec 12th: Class presentation
</li>
<li>Dec 19th: Technical report due
</li>
</ul>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Part 2 Details&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li># of people ~= # of features
</li>
<li>Features should be comprehensive
</li>
<li>Features should be web related
</li>
<li>Evaluation on end-user criteria (including delight)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Heuristics&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Roughly same number of features as number of people
</li>
<li>But do not simply just split up the work
</li>
<li>Because your features need to be cross compatible
</li>
<li>If you make the site mobile compatible, then all pages should be
</li>
<li>Don't spend 2 weeks in photoshop making an awesome background
</li>
<li>If you do a data mining compoenent, it needs to be related to web
activity, or inform the web interface (maybe recommendations?)
</li>
<li>Evaluated: do your forms work, is the page semantic to enable
accessability, is the interface pleasent to use, is it useful?
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Some Ideas&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Automatically choose short path
</li>
<li>Use the same short path for existing URLs
</li>
<li>User sign-in
</li>
<li>Mobile interface
</li>
<li>REST interface
</li>
<li>Recommendation system
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Additions&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>OK to generate some data for ML related features
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Proposal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>What features will you complete?
</li>
<li>Roughly how they will work
</li>
<li>What you anticipate main challenge to be
</li>
<li>Include all team member names
</li>
</ul>
</div>
<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Details&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Work: mostly from an end-user perspective
</li>
<li>Challenges: so I understand where the team is. Ideally you're exploring
an area in which you have less experience
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Project 2 Deliverables&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Code
</li>
<li>Slides
</li>
<li>Technical Report
</li>
</ul>
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> How to&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Pull request should have everything.
</li>
<li>PDF/PPT of slides
</li>
<li>PDF or Tech report
</li>
<li>Presentation may be mostly demo, that's fine. Don't do many slides
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Ideally will be runnable on ISchool
</li>
<li>Advanced work, please use <code>virtualenv</code> with <code>requirements.txt</code>
</li>
<li>If its not implemented, no credit
</li>
<li>User facing quality is evaluated
</li>
</ul>
</div>
<div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Quality&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>Not just "pretty" but functional and using the ideas we talked about in
class
</li>
<li>Semantic markup, CSS for style, REST where appropriate
</li>
<li>Corner cases, validation, security
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Presentation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Very fast! 10 minutes max
</li>
<li>Try out the projector before/after class, spare
</li>
<li>Live demos strongly encouraged, backup
</li>
</ul>
</div>
<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1"><span class="section-number-3">7.1</span> Depends&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li>Will depends on how many submissions I get
</li>
<li>Will go in alphabetical order of last name
</li>
<li>Make people interested in your technical report: "Whoa, how did you do
that?"
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Technical Report&#xa0;&#xa0;&#xa0;<span class="tag"><span class="slide">slide</span></span></h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>Intro
</li>
<li>~1 page / feature
</li>
<li>Problem, example, technology, challeneges, alternatives, future
</li>
</ul>
</div>
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Heuristic&#xa0;&#xa0;&#xa0;<span class="tag"><span class="notes">notes</span></span></h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li>I should have a good start re-implementing your features
</li>
<li>What problem is it solving?
</li>
<li>An example walk though by a user
</li>
<li>The technology details for how you solved it (give an overview, not a step-though of the code)
</li>
<li>Problems you overcame (what advice would you give your past-self before implementing the feature?)
</li>
<li>Alternatives you considered with trade-offs
</li>
<li>Ideas for improving the feature in the future
</li>
</ul>

<script type="text/javascript" src="production/org-html-slideshow.js"></script>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jim Blomo</p>
<p class="date">Created: 2014-10-30 Thu 21:51</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.4)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
